Similar issue, where re-create happens on no change with data retrieved from data-source:

```
data "aws_route53_zone" "enviroment" {
  zone_id = var.hosted_zone_id
}

data "aws_iam_policy_document" "route53" {
  statement {
    sid = "AllowTrexRoute53"
    actions = [
      "route53:ChangeResourceRecordSets"
    ]
    resources = [
      "arn:aws:route53:::hostedzone/${data.aws_route53_zone.enviroment.zone_id}"
    ]
    condition {
      test     = "ForAllValues:StringEquals"
      values   = ["loki.${local.dns_name}"]
      variable = "route53:ChangeResourceRecordSetsNormalizedRecordNames"
    }
  }
}

resource "aws_iam_policy" "route53" {
  name        = "<redacted>-route53"
  path        = "/"
  description = "route53 access to ${data.aws_route53_zone.enviroment.name}"

  policy = data.aws_iam_policy_document.route53.json
}
```

results in:

```
-/+ resource "aws_iam_policy" "route53" {
      ~ arn         = "<redacted>" -> (known after apply)
      ~ description = "route53 access to <redacted>" # forces replacement -> (known after apply) # forces replacement
      ~ id          = "<redacted>" -> (known after apply)
        name        = "<redacted>"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "route53:ChangeResourceRecordSets"
                      - Condition = {
                          - "ForAllValues:StringEquals" = {
                              - "route53:ChangeResourceRecordSetsNormalizedRecordNames" = "<redacted>"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:route53:::hostedzone/<redacted>"
                      - Sid       = "AllowRoute53"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPA2FEP2ECCOJ3AVI3RH" -> (known after apply)
      - tags        = {} -> null
        # (2 unchanged attributes hidden)
    }
```

This is just one example. Another case is where I use count based on data resource:

```
data "aws_security_groups" "agent_access" {
  filter {
    name   = "vpc-id"
    values = [var.vpc_id]
  }
  tags = {
    agent = "true"
  }
}

data "aws_security_group" "agent" {
  count = length(data.aws_security_groups.agent_access.ids)
  id = data.aws_security_groups.agent_access.ids[count.index]
}
```

Results in: 
```
The "count" value depends on resource attributes that cannot be determined until apply, so Terraform cannot predict how many instances will be created. To work around this, use the -target argument to first apply only the resources that the count depends on.
```

The amount of security groups are the same, they are static in this case. Why they can't be retrieved and counted during plan phase?

I've wrote a small python script that does the plan, finds the resources that need to be read, and outputs the apply command targeting those particular resources. 

```
import json
import subprocess
# terraform plan -out=./plan.out
# terraform show -json plan.out > plan.json
# load state from JSON file and find reads 

subprocess.Popen('terraform plan -out=./plan.out', shell=True).wait()
subprocess.Popen('terraform show -json plan.out > plan.json', shell=True).wait()

with open("plan.json", "r") as plan:
    state = json.load(plan)

reads = []
for item in state["resource_changes"]:
    actions = item["change"]["actions"]
    if "read" in actions:
       reads.append(item["address"])

print(f"terraform apply --target {" --target ".join(f'"{resource}"' for resource in reads)}")
```

This fixes the issue for my particular case. 

Run the script above, run resulting target apply, next run is normal apply -> all green, no changes. 

it is ugly, but it works :/ 